import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-group',
  templateUrl: './group.component.html',
  styleUrls: ['./group.component.scss']
})
export class GroupComponent implements OnInit {
  groupsDesktop = [
    ['23 дек, 9:00', 'Страхование с заботой о клиенте', '12', '', '92 %'],
    ['14 ноя, 9:30', 'Главные правила продаж', '10', '', '90 %'],
    ['19 окт, 14:30', 'Первичное обучение КС', '8', '', '86 %'],
    ['10 окт, 16:00', 'Вторичное обучение КС', '18', '', '82 %'],
    ['5 окт, 15:00', 'Вклады: теория и практика', '6', '', '79 %'],
    ['27 сен, 11:00', 'Очное обучение менеджеров', '20', '', '73 %']
  ]

  groupsMobile = [
    ['23 дек, 9:00', 'Страхование с заботой о клиенте', '12', '92 %'],
    ['14 ноя, 9:30', 'Главные правила продаж', '10', '90 %'],
    ['19 окт, 14:30', 'Первичное обучение КС', '8', '86 %'],
    ['10 окт, 16:00', 'Вторичное обучение КС', '18', '82 %'],
    ['5 окт, 15:00', 'Вклады: теория и практика', '6', '79 %'],
    ['27 сен, 11:00', 'Очное обучение менеджеров', '20', '73 %']
  ]

  constructor() { }

  ngOnInit(): void {
  }

  showAlert(x:string) {
    alert(x)
  }

}
